## Production: ecs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 18 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                              NAME                              |
|--------|----------------------------------------------------------------|
| add    | `aws_cloudwatch_log_group.cra_upd_cloudwatch_group`            |
|        | `aws_cloudwatch_log_stream.cra_upd_cloudwatch_stream`          |
|        | `aws_security_group.cra_upd_ecs_sg`                            |
|        | `aws_security_group_rule.cra_upd_sg_rule_ingress_lb_to_ecs`    |
|        | `module.api_ecs.aws_appautoscaling_policy.this[&quot;cpu&quot;]`         |
|        | `module.api_ecs.aws_appautoscaling_policy.this[&quot;memory&quot;]`      |
|        | `module.api_ecs.aws_appautoscaling_target.this[0]`             |
|        | `module.api_ecs.aws_cloudwatch_log_group.this`                 |
|        | `module.api_ecs.aws_ecs_cluster.this[0]`                       |
|        | `module.api_ecs.aws_ecs_cluster_capacity_providers.this[0]`    |
|        | `module.api_ecs.aws_ecs_service.this`                          |
|        | `module.api_ecs.aws_ecs_task_definition.this`                  |
|        | `module.api_ecs.aws_iam_policy.this_task[0]`                   |
|        | `module.api_ecs.aws_iam_policy.this_task_exec`                 |
|        | `module.api_ecs.aws_iam_role.this_task`                        |
|        | `module.api_ecs.aws_iam_role.this_task_exec`                   |
|        | `module.api_ecs.aws_iam_role_policy_attachment.this_task[0]`   |
|        | `module.api_ecs.aws_iam_role_policy_attachment.this_task_exec` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.cra_upd_cloudwatch_group will be created
  + resource "aws_cloudwatch_log_group" "cra_upd_cloudwatch_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/cra-upd-dashboard-cluster"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "production"
          + "Terraform"   = "true"
        }
    }

  # aws_cloudwatch_log_stream.cra_upd_cloudwatch_stream will be created
  + resource "aws_cloudwatch_log_stream" "cra_upd_cloudwatch_stream" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + log_group_name = "/aws/ecs/cra-upd-dashboard-cluster"
      + name           = "cra-upd-dashboard-log-stream"
    }

  # aws_security_group.cra_upd_ecs_sg will be created
  + resource "aws_security_group" "cra_upd_ecs_sg" {
      + arn                    = (known after apply)
      + description            = "ECS Security Group for CRA UPD"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "cra-upd-ecs-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "production"
          + "Terraform"   = "true"
        }
      + vpc_id                 = "vpc-0d40e1aa75cc8f4c2"
    }

  # aws_security_group_rule.cra_upd_sg_rule_ingress_lb_to_ecs will be created
  + resource "aws_security_group_rule" "cra_upd_sg_rule_ingress_lb_to_ecs" {
      + description              = "Allow ingress from load balancer to ECS on port 9000"
      + from_port                = 9000
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-0ffa4f49a1a0b0ca1"
      + to_port                  = 9000
      + type                     = "ingress"
    }

  # module.api_ecs.data.aws_ecs_task_definition.this_latest will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this_latest" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = (known after apply)
      + enable_fault_injection   = (known after apply)
      + ephemeral_storage        = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = (known after apply)
      + id                       = (known after apply)
      + inference_accelerator    = (known after apply)
      + ipc_mode                 = (known after apply)
      + memory                   = (known after apply)
      + network_mode             = (known after apply)
      + pid_mode                 = (known after apply)
      + placement_constraints    = (known after apply)
      + proxy_configuration      = (known after apply)
      + requires_compatibilities = (known after apply)
      + revision                 = (known after apply)
      + runtime_platform         = (known after apply)
      + status                   = (known after apply)
      + task_definition          = "cra-upd-dashboard-app-service"
      + task_role_arn            = (known after apply)
      + volume                   = (known after apply)
    }

  # module.api_ecs.data.aws_iam_policy_document.this_task_exec_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ecr:GetDownloadUrlForLayer",
                              + "ecr:GetAuthorizationToken",
                              + "ecr:BatchGetImage",
                              + "ecr:BatchCheckLayerAvailability",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = "ssm:GetParameter*"
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:ssm:ca-central-1:480754269604:parameter/PAGESPEED_API_KEY",
                              + "arn:aws:ssm:ca-central-1:480754269604:parameter/NOTIFY_EMAIL_2",
                              + "arn:aws:ssm:ca-central-1:480754269604:parameter/NOTIFY_EMAIL",
                              + "arn:aws:ssm:ca-central-1:480754269604:parameter/NOTIFY_API_KEY",
                              + "arn:aws:ssm:ca-central-1:480754269604:parameter/GSC_KEY",
                              + "arn:aws:ssm:ca-central-1:480754269604:parameter/GSC_EMAIL",
                              + "arn:aws:ssm:ca-central-1:480754269604:parameter/FEEDBACK_API_USERNAME",
                              + "arn:aws:ssm:ca-central-1:480754269604:parameter/FEEDBACK_API_PASSWORD",
                              + "arn:aws:ssm:ca-central-1:480754269604:parameter/FEEDBACK_API_HOST",
                              + "arn:aws:ssm:ca-central-1:480754269604:parameter/DOCDB_USERNAME",
                              + "arn:aws:ssm:ca-central-1:480754269604:parameter/DOCDB_PASSWORD",
                              + "arn:aws:ssm:ca-central-1:480754269604:parameter/AW_TECHNICAL_ID",
                              + "arn:aws:ssm:ca-central-1:480754269604:parameter/AW_REPORTSUITE_ID",
                              + "arn:aws:ssm:ca-central-1:480754269604:parameter/AW_ORGANIZATION_ID",
                              + "arn:aws:ssm:ca-central-1:480754269604:parameter/AW_COMPANY_ID",
                              + "arn:aws:ssm:ca-central-1:480754269604:parameter/AW_CLIENT_SECRET",
                              + "arn:aws:ssm:ca-central-1:480754269604:parameter/AW_CLIENT_ID",
                              + "arn:aws:ssm:ca-central-1:480754269604:parameter/AIRTABLE_TOKEN",
                              + "arn:aws:ssm:ca-central-1:480754269604:parameter/AA_CREDS_POOL",
                            ]
                          + Sid      = "AllowSSMParameterAccess"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
        ]
    }

  # module.api_ecs.data.aws_iam_policy_document.this_task_exec_logs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:DescribeLogGroups",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.api_ecs.aws_appautoscaling_policy.this["cpu"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "cpu"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/cra-upd-dashboard-cluster/cra-upd-dashboard-app-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 60
          + scale_out_cooldown = 60
          + target_value       = 60

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.api_ecs.aws_appautoscaling_policy.this["memory"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "memory"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/cra-upd-dashboard-cluster/cra-upd-dashboard-app-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 60
          + scale_out_cooldown = 60
          + target_value       = 60

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.api_ecs.aws_appautoscaling_target.this[0] will be created
  + resource "aws_appautoscaling_target" "this" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 1
      + min_capacity       = 1
      + resource_id        = "service/cra-upd-dashboard-cluster/cra-upd-dashboard-app-service"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags               = {
          + "CostCentre" = "CraUpdDashboard"
          + "Terraform"  = "true"
        }
      + tags_all           = {
          + "CostCentre"  = "CraUpdDashboard"
          + "Environment" = "production"
          + "Terraform"   = "true"
        }

      + suspended_state (known after apply)
    }

  # module.api_ecs.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/cra-upd-dashboard-cluster/cra-upd-dashboard-app-service"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "CraUpdDashboard"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre"  = "CraUpdDashboard"
          + "Environment" = "production"
          + "Terraform"   = "true"
        }
    }

  # module.api_ecs.aws_ecs_cluster.this[0] will be created
  + resource "aws_ecs_cluster" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "cra-upd-dashboard-cluster"
      + tags     = {
          + "CostCentre" = "CraUpdDashboard"
          + "Terraform"  = "true"
        }
      + tags_all = {
          + "CostCentre"  = "CraUpdDashboard"
          + "Environment" = "production"
          + "Terraform"   = "true"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.api_ecs.aws_ecs_cluster_capacity_providers.this[0] will be created
  + resource "aws_ecs_cluster_capacity_providers" "this" {
      + capacity_providers = [
          + "FARGATE",
        ]
      + cluster_name       = "cra-upd-dashboard-cluster"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "FARGATE"
          + weight            = 1
        }
    }

  # module.api_ecs.aws_ecs_service.this will be created
  + resource "aws_ecs_service" "this" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "cra-upd-dashboard-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 50
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 60
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "cra-upd-dashboard-app-service"
      + platform_version                   = "LATEST"
      + propagate_tags                     = "SERVICE"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCentre" = "CraUpdDashboard"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre"  = "CraUpdDashboard"
          + "Environment" = "production"
          + "Terraform"   = "true"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_controller {
          + type = "ECS"
        }

      + load_balancer {
          + container_name   = "cra-upd-dashboard-app-service"
          + container_port   = 9000
          + target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:480754269604:targetgroup/tf-20260112211537088600000001/ab82891f4fda588e"
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-050cdd08641ad8450",
            ]
        }
    }

  # module.api_ecs.aws_ecs_task_definition.this will be created
  + resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "1024"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "cra-upd-dashboard-app-service"
      + id                       = (known after apply)
      + memory                   = "8192"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCentre" = "CraUpdDashboard"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre"  = "CraUpdDashboard"
          + "Environment" = "production"
          + "Terraform"   = "true"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }
    }

  # module.api_ecs.aws_iam_policy.this_task[0] will be created
  + resource "aws_iam_policy" "this_task" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "cra-upd-dashboard-app-service_ecs_task_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:GetObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::cra-upd-dashboard-data-production/*",
                          + "arn:aws:s3:::cra-upd-dashboard-data-production",
                        ]
                      + Sid      = "AllowDataBucketReadAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "CraUpdDashboard"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre"  = "CraUpdDashboard"
          + "Environment" = "production"
          + "Terraform"   = "true"
        }
    }

  # module.api_ecs.aws_iam_policy.this_task_exec will be created
  + resource "aws_iam_policy" "this_task_exec" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "cra-upd-dashboard-app-service_ecs_task_exec_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "CraUpdDashboard"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre"  = "CraUpdDashboard"
          + "Environment" = "production"
          + "Terraform"   = "true"
        }
    }

  # module.api_ecs.aws_iam_role.this_task will be created
  + resource "aws_iam_role" "this_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cra-upd-dashboard-app-service_ecs_task_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "CraUpdDashboard"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre"  = "CraUpdDashboard"
          + "Environment" = "production"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.api_ecs.aws_iam_role.this_task_exec will be created
  + resource "aws_iam_role" "this_task_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cra-upd-dashboard-app-service_ecs_task_exec_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "CraUpdDashboard"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre"  = "CraUpdDashboard"
          + "Environment" = "production"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.api_ecs.aws_iam_role_policy_attachment.this_task[0] will be created
  + resource "aws_iam_role_policy_attachment" "this_task" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "cra-upd-dashboard-app-service_ecs_task_role"
    }

  # module.api_ecs.aws_iam_role_policy_attachment.this_task_exec will be created
  + resource "aws_iam_role_policy_attachment" "this_task_exec" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "cra-upd-dashboard-app-service_ecs_task_exec_role"
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ecs_sg_id = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.cra_upd_cloudwatch_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.cra_upd_ecs_sg"]

21 tests, 19 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
